import i18n from "i18next"
import { initReactI18next } from "react-i18next"

i18n.use(initReactI18next).init({
  resources: {
    ru: {
      translation: {
        GeneralPhrases: {
          Продолжить: "Продолжить",
          Подтвердить: "Подтвердить",
          Оплатить: "Оплатить",
          УзнатьГдеМойЗаказ: "Узнать, где мой заказ",

          Validation: {
            ИмяОбязательно: "Имя обязательно",
            ТелефонОбязателен: "Телефон обязателен",
            ПарольОбязателен: "Пароль обязателен",
            СМСКодОбязателен: "СМС код обязателен",

            PPShortPassword: "Пароль слишком кототкий - минимум 6 символов",
            PPPassCharValid: "Пароль должен обязательно иметь цифры и буквы",

            Необязательно: "Необязательно",
          },
        },

        Dashboard: {
          Главная: "Главная",
          ЛичныйКабинет: "Личный кабинет",
          Меню: "Меню",
          КонструкторПиццы: "Конструктор пиццы",
          ВашиЗаказы: "Ваши заказы",
          Корзина: "Корзина",
          Акции: "Акции",
          УсловияДоставки: "Условия доставки",
          Контакты: "Контакты",
        },

        Auth: {
          LoginScreen: {
            Войти: "Войти",
            ВходСистему: "Вход в систему",
            ПолучитеНовыйПароль: "Получите новый пароль",

            RecieveNewPassScreen: {
              ПолучитьНовыйПароль: "Получить новый пароль",
              PPПолучитьНовыйПароль:
                "Введите номер телефона, введенный вами при регистрации",
              PPВведитеКодСмс: "Введите код полученый в СМС",
              КодВостоновлениеСмс: "Код востоновление из СМС",
              ОтправитьСмсЕщеРаз: "Отправить СМС еще раз",
              БудетДоступноЧерез: "будет доступно через",
            },

            RegionSelectionScreen: {
              ВыберитеВашРегион: "Выберите ваш регион",
            },
          },

          RegisterScreen: {
            Регистрация: "Регистрация",
            Зарегистрироваться: "Зарегистрироваться",

            PPRecievePassBySMS: "Получать каждый раз новый пароль по СМС",

            SuccesfulRegistrationScreen: {
              PPSuccesfulRegisterTitle: "Регистрация прошла успешно",
              PPSuccesfulRegisterSubtitle:
                "Теперь вы можете воспользоваться всеми преимуществами приложения",
            },
          },

          SharedFields: {
            ИмяПользователя: "Имя пользователя",
            НомерТелефона: "Номер телефона",
            ВведитеПароль: "Введите пароль",
          },
        },

        PrivateCabinetScreen: {
          Header: {
            Выйти: "Выйти",
          },

          Credentials: {
            Имя: "Имя",
            Фамилия: "Фамилия",
            Email: "Email",
            НомерТелефона: "Номер телефона",
            Регион: "Регион",
            Пароль: "Пароль",
          },

          CreditCard: {
            КартаОплаты: "Карта оплаты",
            ПривязатьКарту: "Привязать карту",
          },

          OrdersList: {
            ИсторияЗаказов: "История заказов",
            ПоказатьВсеЗаказы: "Показать все заказы",
          },

          Bonuses: {
            Бонусы: "Бонусы",
            УВас: "У вас",
            Бонусов: "бонусов",
            УзнатьКакПотратить: "Узнать как потратить",
          },

          LanguageSection: {
            ЯзыкПриложения: "Язык приложения",
          },
        },

        MenuScreen: {
          АктивныеАкции: "Активые акции",
          ПосмотретьВсеАкции: "Посмотреть все акции",

          ProductItem: {
            ВыберитеРазмер: "Выберите размер для заказа",
          },
        },

        OrdersScreen: {
          Заказы: "Заказы",

          ДобавитьЗаказВКорзину: "Добавить весь заказ в корзину",

          EmptyCase: {
            EmptyCaseTitle: "Пока нет заказов",
            PPEmptyCaseSubtitle:
              "Иследуйте наши блюда и заказывайие с доставкой",
          },
        },

        SalesScreen: {
          ВсеАкции: "Все акцци",
          Посмотреть: "Посмотреть",
          ОткройтеНовыеВкусы: "Откройте новые вкусы",

          EmptyCase: {
            EmptyCaseTitle: "Пока нет акций",
            PPEmptyCaseSubtitle:
              "Иследуйте наши блюда и заказывайие с доставкой",
          },
        },

        PizzaConstructorScreen: {
          КонструкторПиццы: "Конструктор пиццы",
          Добавить: "Добавить",

          IngridientsList: {
            PPВсегдаВходитСтоимость: "Всегда входит в стоимость: ",
            PPДобавки: "Добавки",
          },

          TabNavigator: {
            Мясо: "Мясо",
            Соусы: "Соусы",
            Овощные: "Овощные",
            Сыры: "Сыры",
          },
        },

        ContactsScreen: {
          Контакты: "Контакты",
          Адрес: "Адрес",
          ContactUs: "Связаться с нами",
          PPWorkInfo: `Мы работаем ежедневно с 10:00 до 22:30, и доставляем Вам горячую пиццу и свежие суши`,
        },

        DeliveryTerms: {
          УсловияДоставки: "Условия доставки",
          PPDeliveryTerms: `Мы осуществляем доставку Пиццы и Суши в такие города, как Бровары, а также Калиновка, Княжичи, Требухов и близлежащие поселки ${"\n"} ${"\n"}Доставка по Броварам — БЕСПЛАТНАЯ ${"\n"} ${"\n"} Горяченькую пиццу и свежие суши доставит наш курьер на нашем собственном транспорте 🙂`,
        },

        OrderingProcess: {
          Basket: {
            Корзина: "Корзина",
            ИзменитьСостав: "Изменить состав",

            ЗаказатьСейчас: "Заказать сейчас",
            ЗаказатьНаДругоеВремя: "Заказать на другое время",

            Bonuses: {
              ПотратитьБонусы: "Потратить бонусы",
              СколькоБонусовСписать: "Сколько бонусов списать",

              КоличествоБонусовПревышено: "Количество бонусов превышено",
            },
          },

          DeliveryTimeSelectionScreen: {
            Время: "Время",
            ChooseDeliveryTime: "Выберите время доставки",
            PPChooseDeliveryTime: `Еда начнет готовиться в наилучшее время перед достакой, для того, чтобы ваш заказ был доставлен к вам свежим.`,
          },

          DeliveryTypeSelectionScreen: {
            Доставка: "Доставка",

            Комментарии: "Коментарии",
            ЗабратьСамому: "Забрать самому",
            ВыбратьНаКарте: "Выбрать на карте",
            ВвестеАдресВручную: "Ввести адрес вручную",
            ПодтвердитеАдрес: "Подтвердите адрес",
          },

          SelectAccountScreen: {
            Title: "Выберите один из вариантов, чтобы заказать",
            ОформлениеБезРегистрации: "Оформление без регистрации",
          },

          PaymentScreen: {
            ПодтверждениеЗаказа: "Подтверждение заказа",
            ВремяДоставки: "Время доставки",
          },

          SuccesfulPaymentScreen: {
            ЗаказУспешноОформлен: "Заказ успешно оформлен",
            ОтследитьЗаказ: "Отследить заказ",
            НаГлавную: "На главную",
            //
            СвязатьсяОператором: "Связаться с оператором",
            ЗаказатьОбратныйЗвонок: "Заказать обратный звонок",
          },

          Fields: {
            ИтогоКОплате: "Итого к оплате",
            ДенегКОплате: "Денег к оплате",
            ОплатаЗаДоставку: "К оплате за доставку",
            АдресДоставки: "Адрес доставки",
            СпособОплаты: "Способ оплаты",
          },

          PaymemtMethods: {
            Карта: "Карта",
            PPКартаSubtitle: "Курьер принесет с собой POS терминал",
            кСумме: "к сумме",
            //
            ДобавитьКарту: "Добавить карту",
            //
            НаличнымиКурьеру: "Наличными курьеру",
            //
            КартойКурьеру: "Картой курьеру",
            PPКартойКурьеруSubtitle: "Курьер принесет с собой POS терминал",
          },
        },
      },
    },

    ua: {
      translation: {
        GeneralPhrases: {
          Продолжить: "Продовжити",
          Подтвердить: "Підтвердити",
          Оплатить: "Оплатити",
          УзнатьГдеМойЗаказ: "Дізнатися, де моє замовлення",

          Validation: {
            ИмяОбязательно: "Ім'я обов'язково",
            ТелефонОбязателен: "Телефон обов'язковий",
            ПарольОбязателен: "Пароль обов'язковий",
            СМСКодОбязателен: "СМС код обов'язковий",

            PPShortPassword: "Пароль занадто кототкій - мінімум 6 символів",
            PPPassCharValid: "Пароль повинен обов'язково мати цифри і букви",

            Необязательно: "Необов'язково",
          },
        },

        Dashboard: {
          Главная: "Головна",
          ЛичныйКабинет: "Особистий кабінет",
          Меню: "Меню",
          КонструкторПиццы: "Конструктор піци",
          ВашиЗаказы: "Ваші замовлення",
          Корзина: "Кошик",
          Акции: "Акції",
          УсловияДоставки: "Умови доставки",
          Контакты: "Контакти",
        },

        Auth: {
          LoginScreen: {
            Войти: "Ввійти",
            ВходСистему: "Вхід в систему",
            ПолучитеНовыйПароль: "Отримайте новий пароль",

            RecieveNewPassScreen: {
              ПолучитьНовыйПароль: "Отримати новий пароль",
              PPПолучитьНовыйПароль:
                "Введіть номер телефону, введений вами при реєстрації",
              PPВведитеКодСмс: "Введіть код отриманий в СМС",
              КодВостоновлениеСмс: "Код Востоновление з СМС",
              ОтправитьСмсЕщеРаз: "Відправити СМС ще раз",
              БудетДоступноЧерез: "буде доступно через",
            },

            RegionSelectionScreen: {
              ВыберитеВашРегион: "Виберіть ваш регіонн",
            },
          },

          RegisterScreen: {
            Регистрация: "Реєстрація",
            Зарегистрироваться: "Зареєструватися",

            PPRecievePassBySMS: "Отримувати кожен раз новий пароль по СМС",

            SuccesfulRegistrationScreen: {
              PPSuccesfulRegisterTitle: "Реєстрація пройшла успішно",
              PPSuccesfulRegisterSubtitle:
                "Тепер ви можете скористатися всіма перевагами програми",
            },
          },

          SharedFields: {
            ИмяПользователя: "Ім'я користувача",
            НомерТелефона: "Номер телефону",
            ВведитеПароль: "Введіть пароль",
          },
        },

        PrivateCabinetScreen: {
          Header: {
            Выйти: "Вийти",
          },

          Credentials: {
            Имя: "Ім'я",
            Фамилия: "Прізвище",
            Email: "Email",
            НомерТелефона: "Номер телефону",
            Регион: "Регіон",
            Пароль: "Пароль",
          },

          CreditCard: {
            КартаОплаты: "Карта оплати",
            ПривязатьКарту: "Прив'язати карту",
          },

          OrdersList: {
            ИсторияЗаказов: "Історія замовлень",
            ПоказатьВсеЗаказы: "Показати всі замовлення",
          },

          Bonuses: {
            Бонусы: "Бонуси",
            УВас: "У вас",
            Бонусов: "бонусів",
            УзнатьКакПотратить: "Дізнатися як витратити",
          },

          LanguageSection: {
            ЯзыкПриложения: "Мова додатка",
          },
        },

        MenuScreen: {
          АктивныеАкции: "Активи акції",
          ПосмотретьВсеАкции: "Подивитися всі акції",

          ProductItem: {
            ВыберитеРазмер: "Виберіть розмір для замовлення",
          },
        },

        OrdersScreen: {
          Заказы: "Замовлення",

          ДобавитьЗаказВКорзину: "Додати все замовлення в кошик",

          EmptyCase: {
            EmptyCaseTitle: "Поки немає замовлень",
            PPEmptyCaseSubtitle:
              "Іследует наші страви і заказивайіе з доставкою",
          },
        },

        SalesScreen: {
          ВсеАкции: "Все акцці",
          Посмотреть: "Подивитися",
          ОткройтеНовыеВкусы: "Відкрийте нові смаки",

          EmptyCase: {
            EmptyCaseTitle: "Поки немає акцій",
            PPEmptyCaseSubtitle:
              "Іследует наші страви і заказивайіе з доставкою",
          },
        },

        PizzaConstructorScreen: {
          КонструкторПиццы: "Конструктор піци",
          Добавить: "Додати",

          IngridientsList: {
            PPВсегдаВходитСтоимость: "Завжди входить у вартість: ",
            PPДобавки: "Добавки",
          },

          TabNavigator: {
            Мясо: "М'ясо",
            Соусы: "Соуси",
            Овощные: "Овочеві",
            Сыры: "Сири",
          },
        },

        ContactsScreen: {
          Контакты: "Контакти",
          Адрес: "Звідки",
          ContactUs: "Зв'язатися з нами",
          PPWorkInfo: `Ми працюємо щодня з 10:00 до 22:30, і доставляємо Вам гарячу піцу і свіжі суші`,
        },

        DeliveryTerms: {
          УсловияДоставки: "Умови доставки",
          PPDeliveryTerms: `Ми здійснюємо доставку Піци і Суші в такі міста, як Бровари, а також Калинівка, Княжичі, Требухів та прилеглі селища $ {" \ n "} $ {" \ n "} Доставка по Броварах - БЕЗКОШТОВНА $ {" \ n "} $ {" \ n "} гаряченького піцу і свіжі суші доставить наш кур'єр на нашому власному транспорті 🙂`,
        },

        OrderingProcess: {
          Basket: {
            Корзина: "Кошик",
            ИзменитьСостав: "Змінити склад",

            ЗаказатьСейчас: "Замовити зараз",
            ЗаказатьНаДругоеВремя: "Замовити на інший час",

            Bonuses: {
              ПотратитьБонусы: "Витратити бонуси",
              СколькоБонусовСписать: "Скільки бонусів списати",

              КоличествоБонусовПревышено: "Кількість бонусів перевищено",
            },
          },

          DeliveryTimeSelectionScreen: {
            Время: "Час",
            ChooseDeliveryTime: "Виберіть час доставки",
            PPChooseDeliveryTime: `Їжа почне готуватися в найкращий час перед достакой, для того, щоб ваше замовлення було доставлено до вас свежім.`,
          },

          DeliveryTypeSelectionScreen: {
            Доставка: "Доставка",

            Комментарии: "Коментарі",
            ЗабратьСамому: "Забрати самому",
            ВыбратьНаКарте: "Вибрати на карті",
            ВвестеАдресВручную: "Ввести адресу вручну",
            ПодтвердитеАдрес: "Підтвердіть Адреса",
          },

          SelectAccountScreen: {
            Title: "Виберіть один з варіантів, щоб замовити",
            ОформлениеБезРегистрации: "Оформлення без реєстрації",
          },

          PaymentScreen: {
            ПодтверждениеЗаказа: "Підтвердження замовлення",
            ВремяДоставки: "Час доставки",
          },

          SuccesfulPaymentScreen: {
            ЗаказУспешноОформлен: "Замовлення успішно оформлений",
            ОтследитьЗаказ: "Відстежити замовлення",
            НаГлавную: "На головну",
            //
            СвязатьсяОператором: "Зв'язатися з оператором",
            ЗаказатьОбратныйЗвонок: "Замовити зворотний дзвінок",
          },

          Fields: {
            ИтогоКОплате: "Разом до оплати",
            ДенегКОплате: "Грошей до оплати",
            ОплатаЗаДоставку: "До оплати за доставку",
            АдресДоставки: "Звідки доставки",
            СпособОплаты: "Спосіб оплати",
          },

          PaymemtMethods: {
            Карта: "Карта",
            PPКартаSubtitle: "Кур'єр принесе з собою POS термінал",
            кСумме: "до суми",
            //
            ДобавитьКарту: "Додати карту",
            //
            НаличнымиКурьеру: "Готівкою кур'єру",
            //
            КартойКурьеру: "Картою кур'єру",
            PPКартойКурьеруSubtitle: "Кур'єр принесе з собою POS термінал",
          },
        },
      },
    },
  },
  lng: "ru",
  fallbackLng: "ru",

  interpolation: {
    escapeValue: false,
  },
})
